# 设置
app设置允许用户定制自己对于app行为或者服务行为的喜好
标题中的标签需要显示为“设置”
而其中的每个设置选项要的确是经常被需要设置的

## placement
不要使用“选项”或者“偏好”来作为提示
如果是在抽屉列表或者toolbar的菜单中，则设置应该在最底部（除了帮助和建议以外）

## usage

### 概览
设置项的组织结构和分类明确，合理

### 选择
应该：

- 可以捕获偏好
- 可以快速到达
- 以大部分的用户使用为主；同时存在一些小部分但是很有意义的设置

不应该:

- 不要是很经常使用的那种（应对：应该放在ｔｏｏｌｂａｒ中）
- 不要包含ａｐｐ的信息（应对：可以放在“帮助”选项中）
- 不要用来管理账户（应对：如抽屉列表）

###　默认行为

- 代表大多数的选择
- 使用少的电源和手机数据
- 只能在很重要的时候打断（用户？）

## 分组
（前提是一个界面用很长的列表展示）
- 如果设置项只有７个或更少，那么不分类
- 如果是９－１０个，那么把相关的设置分成２到３类
`如果很重要，那么就不要分类，放最上面`；`如果不重要，那么就放入最底部的其他栏`
- １１－１５个，分３－５个，可以把同一类的相临ｉｔｅｍ合如一个多子项的大项

## 标签和secondary text

### 标签
使用非个人用于：Notifications" instead of "Notify me.
使用第二人称：  ("you") rather than ("I").

禁用：
“口语化”、“子标题和设置项名称重复”、“专业术语--除非大家耳熟能详”
### secondary text
非必选项。用来解释
switch设置项：表述开关switch时会发生的事情（即将发生的事）
其他设置想：表述当前状态

表述要通俗易懂











































